using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace WebApplication.Models
{
    public class DB
    {
        public static List<Service> ServicesList = new List<Service>()
        {
            new Service(1,Services.GRAPHOLOGY,"פיענוח כתבים והעברת סדנאות והרצאות בנושא","תחום הגרפולוגיה חוקר את הקשר שבין כתב היד לאופי האדם והתנהגותו. הגרפולוגיה מבוססת על מספר הנחות יסוד: תכונות שונות של האדם מוצאות ביטוי בכתב ידו, האדם אינו יכול לשנות מרצונו את צורת כתיבתו מבלי שהדבר ייראה ואות או צורת תו אינה מייצגת בהכרח תכונה מסוימת ויש לפרש את משמעותה על פי הנסיבות, ההקשר ועוצמת הלחץ.",5,"מכון לגרפולוגיה | חנה קורן"),
            new Service(2,Services.CARDS,"שיטת טיפול באמצעות כרטיסים טיפוליים.","קלפי הטיפול והאימון הם כלי עבודה יעיל המאפשרים לנו להרחיב את אמצעי הדיבוב והתקשורת בננו ובין המטופל במהלך סדרת מפגשי הטיפול.קלפי הטיפול והאימון  (קלפי קסם)  – הם ערכות קלפים השלכתיים שפותחו בשיתוף פעולה של אנשי מקצוע טיפוליים ואנשי מקצוע מתחום האימון. הקלפים השונים מכילים ציורים, צילומים, ומילים במגוון מצבי חיים..",8,"מעיינות"),
            new Service(3,Services.FLOWERS,"טיפול באמצעות תמציות פרחי באך.","פרחי באך היא שיטת טיפול אשר פותחה בתחילת המאה ה-20 על ידי החוקר, הרופא וההומאופת האנגלי, ד'ר אדוארד באך. לאחר שנות מחקר והתנסות קלינית, מצא ד'ר באך 38 פרחי בר, עצים ושיחים אשר מהם הפיק תמציות אנרגטיות. באמצעות תמציות אלו ניתן לטפל במצבי לחץ וחרדה, לבנות ביטחון עצמי, לשפר יכולות אישיות ולרפא מחלות פיזיות.",8,"פרמה גורי"),
        };
        public static List<Comment> CommentsList = new List<Comment>()
        {
            new Comment(1,Services.GRAPHOLOGY,"תודה על ערב חווייתי. זו משימה לא קלה להפעיל 30 אנשים ועשית את זה בגדול!!! האבחון הגרפולוגי המשעשע היה מדוייק להפליא, ממש כאילו את מכירה את כולנו.","צוות סמינר מעלות",10,new DateTime(2020,8,30)),
            new Comment(2,Services.FLOWERS,"רציתי להודות לך על הייעוץ, הליווי , ההמלצות ובעיקר על הדרך.","שושנה",11,new DateTime(2019,12,30)),
            new Comment(3,Services.CARDS,"שרי מטפלת נפלאה. בהתחלה היו לי ספקות, משום שטפלתי בעבר ללא הצלחה, אך הופתעתי לטובה. ככל הנראה כי היא מבינה ב״ אנשים רגישים״. אני שמחה שיצא לי לעבור תהליך ביחד איתה ולהביא את עצמי למקום יותר טוב. אומנם יש לי עוד דרך אבל את הכיוון ללא ספק יש.","תודה.",15,new DateTime(2020,6,15)),
            new Comment(4,Services.GRAPHOLOGY,"ברצוני להודות לך, על ערב חברה נפלא שהעברת בתאריך 17/06/2021 .הערב  הועבר באופן מקצועי נעים ומבדר. תודה על ערב מהנה אשר ענה בהחלט על צרכינו כערב גיבוש.","ת.פ",13,new DateTime(2021,11,8)),
            new Comment(5,Services.GRAPHOLOGY,"שרי היקרה! תודה רבה על הניתוח המדויק, אמליץ הלאה לחברותיי","פנינה לב",10,new DateTime(2020,7,1)),
            new Comment(6,Services.CARDS,"רצינו להביע תודתינו, על תקופה של השקעה ומסירות מוטי שלנו גדל ופורח ובעזרת ה' נמשיך לראות תוצאות טובות תודה! ","אבא ואמא של מוטי",15,new DateTime(2022,4,12)),
            new Comment(7,Services.GRAPHOLOGY,"תודה שעזרת לי להחליט איזה מקצוע מתאים לי ללמוד","תמר חזן",8,new DateTime(2010,1,25)),
            new Comment(8,Services.FLOWERS,"הטיפול השבועי אצלך תמיד מחזיר את הגוף שלי לפוקוס ואת הנפש לרוגע ושלווה. זהו טיפול שלדעתי כל אחד חייב לעצמו בכדי לשפר את איכות חייו.","א.כ",11,new DateTime(2017,8,28)),
            new Comment(9,Services.GRAPHOLOGY,"מדהים אני עדיין המומה, תודה שרי על מה שכתבת לי הטיפ שלך היה בדיוק מה שהייתי צריכה!","חנה",8,new DateTime(2015,9,20)),
            new Comment(10,Services.CARDS,"תודה על שנה נפלאה שנה של השקעה, התמסרות, והקשבה!","אלפי תודות.",15,new DateTime(2016,4,3)),

        };
    }
}